log/lis/20140616-2343/aws_test_lis.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

    <clients>
      <client host="localhost" maxusers="50000" use_controller_vm="true"/>
    </clients>

    <servers>
	<server host="aws-bal" port="80" type="tcp"/>
    </servers>

    <monitoring>
        <monitor host="localhost" type="erlang"/>
    </monitoring>

    <load loop="1">
        <arrivalphase phase="1" duration="5" unit="minute">
            <users arrivalrate="100" unit="minute"/>
        </arrivalphase>
        <arrivalphase phase="2" duration="5" unit="minute">
            <users arrivalrate="200" unit="minute"/>
        </arrivalphase>
        <arrivalphase phase="3" duration="5" unit="minute">
            <users arrivalrate="300" unit="minute"/>
        </arrivalphase>
        <arrivalphase phase="4" duration="5" unit="minute">
            <users arrivalrate="400" unit="minute"/>
        </arrivalphase>
        <arrivalphase phase="5" duration="5" unit="minute">
            <users arrivalrate="500" unit="minute"/>
        </arrivalphase>
        <arrivalphase phase="6" duration="5" unit="minute">
            <users arrivalrate="600" unit="minute"/>
        </arrivalphase>
    </load>

    <options>
        <option name="file_server" id="maclist" value="./csv/maclist.csv"/>
        <option name="file_server" id="devlist" value="./csv/devlist.csv"/>
    </options>

    <sessions>

        <session name="listen" weight="1" type="ts_http">
            <setdynvars sourcetype="file" fileid="devlist" delimiter="\n" order="iter">
                <var name="dev"/>
            </setdynvars>
            <transaction name="listen">
                <request subst="true">
                    <http url="/ds/listen/%%_dev%%" method="GET" version="1.1"/>
                </request> 
            </transaction>
        </session>

  </sessions>

</tsung>